Tekla.Structures.Drawing.CannotModifyNonActiveDrawingException
The CannotModifyNonActiveDrawingException class defines the exception
that is thrown when a user tries to modify a drawing
that is not set as active.

Tekla.Structures.Drawing.CannotModifyNonActiveDrawingException.#ctor(System.String)
Creates a new cannot modify non-active drawing exception instance.
Message: The exception message.

Tekla.Structures.Drawing.CannotModifyNonActiveDrawingException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.